data/vllm_benchmark/delta2_conc8.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x778ba7f18d30>, trust_remote_code=False, seed=0, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=30, random_output_len=200, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://127.0.0.1:8008', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model=None, input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-03fdc2ca-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'vllm_xargs': {'gamma': 0.5, 'delta': 2.0, 'seeding_scheme': 'gpu-fused-selfhash-fullvocab', 'hash_key': 15485863}}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
Model not specified, fetching first model from server...
First model name: Qwen/Qwen3-8B, first model id: Qwen/Qwen3-8B
INFO 07-10 12:50:28 [datasets.py:700] Sampling input_len from [30, 30] and output_len from [200, 200]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 128/128 [01:19<00:00,  1.62it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  79.25     
Total input tokens:                      3840      
Total generated tokens:                  25600     
Request throughput (req/s):              1.62      
Output token throughput (tok/s):         323.03    
Peak output token throughput (tok/s):    376.00    
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          371.48    
---------------Time to First Token----------------
Mean TTFT (ms):                          617.75    
Median TTFT (ms):                        105.42    
P99 TTFT (ms):                           8323.19   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          21.78     
Median TPOT (ms):                        21.78     
P99 TPOT (ms):                           21.91     
---------------Inter-token Latency----------------
Mean ITL (ms):                           21.79     
Median ITL (ms):                         21.77     
P99 ITL (ms):                            22.77     
==================================================